{
  "instance_id": "pair::39_us_60::43_us_497",
  "cited_case": {
    "us_cite": "39 U.S. 60",
    "case_name": "THE COMMERCIAL AND RAIL ROAD BANK OF VICKSBURG, PLAINTIFF IN ERROR, VS. SLOCOMB, RICHARDS AND COMPANY, DEFENDANTS IN ERROR",
    "term": 1840,
    "case_disposition": 4,
    "party_winning": 1,
    "majority_opinion": "delivered the opinion of the Court. This is a writ of error to the Circuit Court of the United States, for the Southern District of Mississippi. It was an action on the case in assumpsit, brought by the defendants in error, citizens of Louisiana, against the plaintiffs in error. The defendants in the Court below appeared by attorney, and pleaded to the jurisdiction of the Court; averring in their plea that they were a corporation aggregate, and that their corporators, stockholders, or company, were composed of citizens of other and different states; to wit, that William M. Lambeth and William E. Thompson, citizens of Louisiana, were, at the time that the suit was instituted, and at the time of filing the plea, stockholders and corporators therein. The plaintiffs in the Court below demurred to this plea, assigning specially several causes of demurrer, as follows: 1. That the plea was not properly entitled of any term of the Court. 2. That the affidavit in support of the plea was not sufficient, nor was it properly attested. 3. That the matters set forth in the plea were not sufficient to abate the plaintiffs' suit. The Court sustained the demurrer, and gave judgment against the defendants, for three thousand five hundred and seventy-five dollars and fifty-four cents, in damages; being the amount of the principal and interest of a certificate of deposite, on which the suit was brought, and for the costs. To reverse this judgment, this writ of error is brought. In examining the correctness of the judgment of the Court upon the demurrer, we throw out of consideration the two first causes assigned; because if there were any irregularity in the particulars stated, they could at most only be urged as objections to the receiving of the plea: but could not be relied upon as grounds of demurrer; the office of which is, to put in issue the legal effect of a plea, after it has been received. The third cause assigned, which was, that the plea was not sufficient    to abate the plaintiffs' suits, raises the only question to be decided; and that is, whether, upon the state of the parties, as appearing upon the record, the Court had jurisdiction of the case. It will be observed, that the plaintiffs were citizens of Louisiana; so averred to be in the declaration; and two of the members of the corporation sued were also citizens of Louisiana. They are so averred to be in the plea, and the demurrer admits the truth of this averment. The eleventh section of the Judiciary Act of 1789, gives to the Circuit Courts of the United States jurisdiction in cases where \"the suit is between a citizen of the state where the suit is brought, and a citizen of another state.\" This Court were called upon, at an early period, to construe this section of the Judiciary Act, in relation to the very question raised by the pleadings in this case. In the case of Strawbridge and others vs. Curtis and others, 3 Cranch 267, they decided that where there are two or more joint plaintiffs, and two or more joint defendants, each of the plaintiffs must be capable of suing each of the defendants in the Courts of the United States, in order to support the jurisdiction. And what is more particularly applicable to this case, in the case of The Bank of the United States vs. Deveaux and others, 5 Cranch 61, this Court decided, that a corporation aggregate, composed of citizens of one state, might sue a citizen of another state in the Circuit Courts of the United States; that is, they in effect decided, that although the artificial being, a corporation aggregate, was not a citizen, as such, and therefore could not sue in the Courts of the United States, as such, yet the Court would look beyond the mere corporate character, to the individuals of whom it was composed; and if they were citizens of a different state from the party sued, they were competent to sue in the Courts of the United States. But still, upon the principle of Strawbridge vs. Curtis, all the corporators must be citizens of a different state from the party sued. And the doctrine of both these cases has ever since been held to be the law of this Court. It is perfectly clear, that the same principle applies to the individuals composing a corporation aggregate, when standing in the attitude of defendants, which does when they are in that of plaintiffs. The application of these doctrines to this case, would seem to be decisive of its fate; unless there is something in other points which were argued at the bar to obviate their force. For it has already been stated that the plaintiffs in the Court below were citizens of the state of Louisiana, and two of the members of the corporation sued were also citizens of Louisiana; so that some of the defendants being citizens of the same state with the plaintiffs, it follows, that although each of the plaintiffs was capable of suing, yet each of the defendants was not capable of being sued in the Circuit Court of Mississippi. But it was contended at the bar, that whatever might have been the original ground of objection to the jurisdiction of the Court, the    defendants had appeared by attorney; and that such an appearance waived all objection to the jurisdiction of the Court. This is admitted to be a well established rule, in pleas of this sort; in Courts of general jurisdiction, where the plea is interposed by individual defendants. We deem it unnecessary, for the purposes of this case, to inquire what would be the effect of an appearance by attorney of an individual defendant, in pleading such a plea in the Circuit Courts of the United States, which are of limited jurisdiction. But we are clearly of opinion, that in the case of a corporation aggregate, no waiver of an objection to jurisdiction could be produced, by their appearing and pleading by attorney: because, as such a corporation cannot appear but by attorney; to say that such an appearance would amount to a waiver of the objection, would be to say, that the party must from necessity forfeit an acknowledged right, by using the only means which the law affords of asserting that right. It was further contended, that all objection to the state of the parties in this case was obviated by the act of Congress, passed February 28th, 1839, entitled, \"An act, in amendment of the acts respecting the judicial system of the United States.\" The first section of that act provides, \"That where in any suit at law, or in equity, commenced in any Court of the United States, there shall be several defendants, any one or more of whom shall not be inhabitants of, or found within the district where the suit is brought, or shall not voluntarily appear thereto, it shall be lawful for the Court to entertain jurisdiction, and proceed to the trial and adjudication of such suit between the parties who may be properly before it; but the judgment or decree rendered therein shall not conclude or prejudice other parties, not regularly served with process, or not voluntarily appearing to answer.\" We consider the true construction of this act to be this:  The eleventh section of the Judiciary Act, after having prescribed the jurisdiction of the Circuit Courts, as it regards the character of the parties, by way of personal exemption, declares, \"That no civil suit shall be brought before either of said Courts against an inhabitant of the United States, by any original process, in any other district than that whereof he is an inhabitant, or in which he shall be found, at the time of serving the writ.\" Under the operation of this clause many difficulties occurred in practice, in cases both in law and equity, in which, by the principles governing Courts both of law and equity, it was necessary to join several defendants, some of whom were, and others were not, inhabitants of the district in which the suit was brought. The act of 1839 was intended to remove these difficulties; by providing, that the persons not being inhabitants, or not found within the district, may either not be joined at all with those who were, or if joined, and they did not waive their personal exemption, by a voluntary appearance, the Court may go on to judgment or decree against the parties properly before it, as if the others had not been joined.   But it did not contemplate a change in the jurisdiction of the Courts, as it regards the character of the parties, as prescribed by the Judiciary Act, and as expounded by this Court; that is, that each of the plaintiffs must be capable of suing, and each of the defendants, capable of being sued: which is not the case in this suit; some of the defendants being citizens of the same state with the plaintiffs. There is another reason why this act of 1839 cannot apply to this case. It expressly declares, that the judgment or decree shall not conclude or prejudice other parties not regularly served with process, or not voluntarily appearing to answer. Now the defendants in this case being a corporation aggregate, any judgment against them must be against them in their corporate character: and the judgment must be paid out of their corporate funds, in which is included the interest of the two Louisiana stockholders; and, consequently, such a judgment must of necessity prejudice those parties, in direct contravention of the language of the law. We are of opinion that the judgment of the Circuit Court was erroneous, in sustaining the plaintiffs' demurrer to defendants' plea: it is therefore reversed; and the case is remanded to the Circuit Court, to be proceeded in according to law. This cause came on to be heard on the transcript of the record from the Circuit Court of the United States for the Southern District of Mississippi, and was argued by counsel. On consideration whereof, it is now here ordered and adjudged by this Court, that the judgment of the said Circuit Court in this cause be, and the same is hereby, reversed, with costs; and that this cause be, and the same is hereby, remanded to the said Circuit Court, with directions to proceed therein according to law and justice, in conformity to the opinion of this Court."
  },
  "citing_case": {
    "us_cite": "43 U.S. 497",
    "case_name": "THE LOUISVILLE, CINCINNATI, AND CHARLESTON RAIL-ROAD COMPANY, PLAINTIFFS IN ERROR, v. THOMAS W. LETSON, DEFENDANT",
    "majority_opinion": "The jurisdiction of the court is denied in this case upon the grounds that two members of the corporation sued are citizens of North Carolina, that the State of South Carolina is also a member, and that two other corporations in South Carolina are members, having in them members who are citizens of the same state with the defendant in error.\n\nThe objection that the State of South Carolina is a member cannot be sustained.  Cases have been already decided by this Court which overrule it.  The doctrine is if the state be not necessarily a defendant, though its interest may be affected by the decision, the courts of the United States are bound to exercise jurisdiction.   United States v. Pet. 5 Cranch 115.  In the case of  Bank of the United States v. Planters' Bank of Georgia,  this Court ruled\n\"that when a government becomes a partner in a trading concern, it divests itself, so far as it concerns the transactions of that company, of its sovereign character and takes that of a private citizen.  Instead of communicating to the company its privileges and its prerogatives, it descends to a level with those with whom it associates itself and takes the character which belongs to its associates and to the business which is to be transacted.  Thus many states of this Union which have an interest in banks are not suable even in their own courts, yet they never exempt the corporation from being sued.  The State of Georgia, by giving to the bank the capacity to sue and be sued, voluntarily strips itself of its sovereign character so far as respects the transactions of the bank, and waives all the privileges of that character.\"\n 22 U. S. 9  Wheat. 907.  South Carolina stands in the same attitude in the case before us, that Georgia did in the case in 9 Wheaton.  It is no objection, then, to the jurisdiction of the court on account of the averment in the plea that the State of South Carolina is a member of the Louisville, Cincinnati & Charleston Railroad Company.  The true principle is that the jurisdiction of the circuit courts of the United States cannot be decreed or taken away on account of a state's having an interest in a suit unless the state is a party on the record.   Osborne v. Bank of the United States,  9 Wheat. 852.  This must be the rule under our system, whether the jurisdiction of the court is denied on account of any interest which a state may have in the subject matter of the suit or when it is alleged that jurisdiction does not exist on account of the character of the parties.\nWe will here consider that averment in the plea which alleges that the court has not jurisdiction\n\"because the Louisville, Cincinnati & Charleston Railroad Company is not a corporation whose members are citizens of South Carolina, but that some of the members of the said corporation are citizens of South Carolina and some of them, namely, John Rutherford and Charles Baring, are and were at the time of commencing the said action citizens of North Carolina.\"\nThe objection is equivalent to this proposition -- that a corporation in a state cannot be sued in the circuit courts of the United States by a citizen of another state unless all the members of the corporation are citizens of the state in which the suit is brought.\n\nThe suit in this instance is brought by a citizen of New York in the Circuit Court of the United States for the District of South Carolina, which is the locality of the corporation sued. \n\n\nJurisdiction is denied because it is said it is only given when \"the suit is between a citizen of the state where the suit is brought and a citizen of another state.\"  And it is further said that the present is not such a suit, because two of the corporators are citizens of a third state.\nThe point in this form has never before been under the consideration of this Court.  We are not aware that it ever occurred in either of the circuits until it was made in this case.  It has not then been directly ruled in any case.  Our inquiry now is what is the law upon the proposition raised by the plea.\nOur first remark is that the jurisdiction is not necessarily excluded by the terms when \"the suit is between a citizen of the state where the suit is brought and a citizen of another state\" unless the word \"citizen\" is used in the Constitution and the laws of the United States in a sense which necessarily excludes a corporation.\nA corporation aggregate is an artificial body of men, composed of divers constituent members  ad instar corporis humani,  the ligaments of which body politic, or artificial body, are the franchises and liberties thereof, which bind and unite all its members together, and in which the whole frame and essence of the corporation consist.  Bac.Abr.Corp. (A).  It must of necessity have a name, for the name is, as it were, the very being of the Constitution, the heart of their combination, with out which they could not perform their corporate acts, for it is nobody to plead and be impleaded, to take and give, until it hath gotten a name.  Bac.Abr.Corp. (C).\nComposed of persons, it may be that the members are citizens -- and if they are, though the corporation can only plead and be impleaded by its name, or the name by which it may sue or be sued, if a controversy arises between it and a plaintiff who is a citizen of another state, and the residence of the corporation is in the state in which the suit is brought, is not the suit substantially between citizens of different states, or, in the words of the act giving to the courts jurisdiction, \"a suit between a citizen of the state where the suit is brought and a citizen of another state?\"\n\nJurisdiction, in one sense, in cases of corporations, exists in virtue of the character of members, and must be maintained in the courts of the United States unless citizens can exempt themselves from their constitutional liability to be sued in those courts by a citizen of another state by the fact that the subject of controversy between them has arisen upon a contract to which the former are parties, in their corporate and not in their personal character. \n\n\nConstitutional rights and liabilities cannot be so taken away or be so avoided.  If they could be, the provision which we are here considering could not comprehend citizens universally, in all the relations of trade, but only those citizens in such relations of business as may arise from their individual or partnership transactions.\nLet it then be admitted for the purposes of this branch of the argument that jurisdiction attaches in cases of corporations in consequence of the citizenship of their members, and that foreign corporations may sue when the members are aliens; does it necessarily follow, because the citizenship and residence of the members give jurisdiction in a suit at the instance of a plaintiff of another state, that all of the corporators must be citizens of the state in which the suit is brought?\nThe argument in support of the affirmative of this inquiry is that in the case of a corporation in which jurisdiction depends upon the character of the parties, the court looks beyond the corporation to the individuals of which it is composed for the purpose of ascertaining whether they have the requisite character, and for no other purpose.\nThe object would certainly be to ascertain the character of the parties, but not to the extent of excluding all inquiry as to what the effect will be when it has been ascertained that the corporators are citizens of different states from that of the locality of the corporation, where by its charter it can only be sued.\nThen the question occurs, if the corporation be only suable where its locality is, and those to whom its operations are confided are citizens of that state, and a suit is brought against it by a citizen of another state, whether by a proper interpretation of the terms giving to the circuit court jurisdiction it is not a suit between citizens of the state where the suit is brought and a citizen of another state.  The fact that the corporators do live in different states does not aid the solution of the question.\nThe first, obvious, and necessary interpretation of the terms by which jurisdiction is given is that the suit need not be between citizen and citizen, but may be between citizens.  Then do the words \"of the state where the suit is brought\" limit the jurisdiction to a case in which all the defendants are citizens of the same state?\n\nThe constitutional grant of judicial power extends to controversies \"between citizens of different states.\"  The words in the legislative grant of jurisdiction \"of the state where the suit is brought and \n\n a citizen of another state\" are obviously no more than equivalent terms to confine suits in the circuit courts to those which are \"between citizens of different states.\"  The words in the Constitution, then, are just as operative to ascertain and limit jurisdiction as the words in the statute.  It is true that under these words \"between citizens of different states,\" Congress may give the courts jurisdiction between citizens in many other forms than that in which it has been conferred.  But in the way it is given, the object of the legislature seems exclusively to have been to confer jurisdiction upon the court, strictly in conformity to the limitation as it is expressed in the Constitution, \"between citizens of different states.\"\nA suit then brought by a citizen of one state against a corporation by its corporate name in the state of its locality, by which it was created and where its business is done by any of the corporators who are chosen to manage its affairs, is a suit, so far as jurisdiction is concerned, between citizens of the state where the suit is brought and a citizen of another state.  The corporators as individuals are not defendants in the suit, but they are parties having an interest in the result, and some of them being citizens of the state where the suit is brought, jurisdiction attaches over the corporation -- nor can we see how it can be defeated by some of the members, who cannot be sued, residing in a different state.  It may be said that the suit is against the corporation, and that nothing must be looked at but the legal entity and then that we cannot view the members except as an artificial aggregate.  This is so in respect to the subject matter of the suit and the judgment which may be rendered, but if it be right to look to the members to ascertain whether there be jurisdiction or not, the want of appropriate citizenship in some of them to sustain jurisdiction, cannot take it away when there are other members who are citizens with the necessary residence to maintain it.\nBut we are now met and told that the cases of  Srawbridge v. Curtiss,  3 Cranch 267, and that of  Bank of the United States v. Deveaux,  5 Cranch 84, hold a different doctrine.\n\nWe do not deny that the language of those decisions does not justify in some degree the inferences which have been made from them, or that the effect of them has been to limit the jurisdiction of the circuit courts in practice to the cases contended for by the counsel for the plaintiff in error.  The practice has been, since those cases were decided, that if there be two or more plaintiffs and two or more joint defendants, each of the plaintiffs must be capable of suing each \n\n of the defendants in the courts of the United States in order to support the jurisdiction, and in cases of corporation to limit jurisdiction to cases in which all the corporators were citizens of the state in which the suit was brought.  The case of  Strawbridge v. Curtiss  was decided without argument.  That of  Bank v. Deveaux  after argument of great ability.  But never since that case has the question been presented to this Court with the really distinguished ability of the arguments of the counsel in this -- in no way surpassed by those in the former.  And now we are called upon in the most imposing way to give our best judgments to the subject, yielding to decided cases everything that can be claimed for them on the score of authority except the surrender of conscience.\n\nAfter mature deliberation, we feel free to say that the cases of  Strawbridge v. Curtiss  and that of  Bank v. Deveaux  were carried too far, and that consequences and inferences have been argumentatively drawn from the reasoning employed in the latter which ought not to be followed.  Indeed it is difficult not to feel that the case of   Bank of the United States v. Planters' Bank of Georgia  is founded upon principles irreconcilable with some of those on which the cases already adverted to were founded.  The case of  Commercial Bank of Vicksburg v. Slocomb  was most reluctantly decided upon the mere authority of those cases.  We do not think either of them maintainable upon the true principles of interpretation of the Constitution and the laws of the United States.  A corporation created by a state to perform its functions under the authority of that state and only suable there, though it may have members out of the state, seems to us to be a person, though an artificial one, inhabiting and belonging to that state, and therefore entitled, for the purpose of suing and being sued, to be deemed a citizen of that state.  We remark too that the cases of  Strawbridge v. Curtiss  and  Bank v. Deveaux  have never been satisfactory to the bar, and that they were not, especially the last, entirely satisfactory to the Court that made them.  They have been followed always most reluctantly and with dissatisfaction.  By no one was the correctness of them more questioned than by the late Chief Justice who gave them.  It is within the knowledge of several of us that he repeatedly expressed regret that those decisions had been made, adding whenever the subject was mentioned that if the point of jurisdiction was an original one, the conclusion would be different.  We think we may safely assert that a majority of the members of this Court \n\n have at all times partaken of the same regret, and that whenever a case has occurred on the circuit involving the application of the case of  Bank v. Deveaux,  it was yielded to because the decision had been made, and not because it was thought to be right.  We have already said that the case of  Bank of Vicksburg v. Slocomb,  14 Pet. was most reluctantly given upon mere authority.  We are now called upon, upon the authority of those cases alone, to go further in this case than has yet been done.  It has led to a review of the principles of all the cases.  We cannot follow further, and upon our maturest deliberation we do not think that the cases relied upon for a doctrine contrary to that which this Court will here announce, are sustained by a sound and comprehensive course of professional reasoning.  Fortunately a departure from them involves no change in a rule of property.  Our conclusion, too, if it shall not have universal acquiescence, will be admitted by all to be coincident with the policy of the Constitution and the condition of our country.  It is coincident also with the recent legislation of Congress as that is shown by the Act of 28 February, 1839, in amendment of the acts respecting the judicial system of the United States.  We do not hesitate to say that it was passed exclusively with an intent to rid the courts of the decision in the case of  Strawbridge v. Curtiss. \nBut if in all we have said upon jurisdiction we are mistaken, we say that the Act of 28 February, 1839, enlarges the jurisdiction of the courts, comprehends the case before us, and embraces the entire result of the opinion which we shall now give.\nThe first section of that act provides\n\"That where in any suit at law or in equity commenced in any court of the United States there shall be several defendants, any one or more of whom shall not be inhabitants of, or found within the district where the suit is brought, or shall not voluntarily appear thereto, it shall be lawful for the court to entertain jurisdiction and proceed to the trial and adjudication of such suit between the parties who may be properly before it; but the judgment or decree rendered therein shall not conclude or prejudice other parties not regularly served with process or not voluntarily appearing to answer.\"\nWe think, as was said in the case of  Commercial Bank of Vicksburg v. Slocomb  that this act was intended to remove the difficulties which occurred in practice, in cases both in law and equity, under that clause in the 11th section of the Judiciary Act, which declares\n\n\"That no civil suit shall be brought before either \n  \n of said courts against an inhabitant of the United States by any original process in any other district than that whereof he is an inhabitant or in which he shall be found at the time of serving the writ,\"\nbut a reexamination of the entire section will not permit us to reaffirm what was said in that case, that the act did not contemplate a change in the jurisdiction of the courts as it regards the character of the parties.  If the act in fact did no more than to make a change by empowering the courts to take cognizance of cases other than such as were permitted in that clause of the 11th section, which we have just cited, it would be an enlargement of jurisdiction as to the character of parties.  The clause that the judgment or decree rendered shall not conclude or prejudice other parties who have not been regularly served with process or who have not voluntarily appeared to answer is an exception, exempting parties so situated from the enactment and must be so strictly applied.  It is definite as to the persons of whom it speaks, and contains no particular words as a subsequent clause by which the general words of the statute can be restrained.  The general words embrace every suit at law or in equity in which there shall be several defendants\n\"any one or more of whom shall not be inhabitants of, or found within the district where the suit is brought, or who shall not voluntarily appear thereto.\"\nThe words, \"shall not be inhabitants of\" applies as well to corporators as to persons who are not so, and if, as corporators, they are not suable individually and cannot be served with process or voluntarily appear in an action against the corporation of which they are members, the conclusion should be that they are not included in the exception, but are within the general terms of the statute.  Or, if they are viewed as defendants in the suit, then, as corporators, they are regularly served with process in the only way the law permits them to be when the corporation is sued by its name.\n\nThe case before us might be safely put upon the foregoing reasoning and upon the statute, but hitherto we have reasoned upon this case upon the supposition that in order to found the jurisdiction in cases of corporations, it is necessary there should be an averment which, if contested, was to be supported by proof that some of the corporators are citizens of the state by which the corporation was created, where it does its business, or where it may be sued.  But this has been done in deference to the doctrines of former cases in this Court upon which we have been commenting.  But there is a broader ground upon which we desire to be understood, upon which we \n\n altogether rest our present judgment, although it might be maintained upon the narrower ground already suggested.  It is that a corporation created by and doing business in a particular state is to be deemed to all intents and purposes as a person, although an artificial person, an inhabitant of the same state, for the purposes of its incorporation, capable of being treated as a citizen of that state as much as a natural person.  Like a citizen, it makes contracts, and though in regard to what it may do in some particulars it differs from a natural person, and in this especially, the manner in which it can sue and be sued, it is substantially, within the meaning of the law, a citizen of the state which created it and where its business is done, for all the purposes of suing and being sued.  And in coming to this conclusion as to the character of a corporation, we only make a natural inference from the language of this Court upon another occasion, and assert no new principle.\nIn the case of  Dartmouth College v. Woodward,  4 Wheat. 636, this Court says\n\"A corporation is an artificial being, invisible, intangible, and existing only in contemplation of law.  Being the mere creature of law, it possesses only those properties which the charter of its creation confers upon it, either expressly or as incidental to its very existence.  These are such as were supposed best calculated to effect the object for which it was created.  Among the most important are immortality, and if the expression may be allowed, individuality -- properties by which a perpetual succession of many persons are considered as the same and may act as a single individual.  They enable a corporation to manage its own affairs and to hold property without the perplexing intricacies, the hazardous and endless necessity, of perpetual conveyances for the purpose of transmitting it from hand to hand.  It is chiefly for the purpose of clothing bodies of men in succession with these qualities and capacities that corporations were invented and are in use.  By these means, a perpetual succession of individuals are capable of acting for the promotion of the particular object like one immortal being.\"\nAgain, in  Providence Bank and Billings,  4 Pet. 514, it is said,\n\"The great object of an incorporation is to bestow the character and properties of individuality on a collective and changing body of men.  This capacity is always given to such a body.  Any privileges which may exempt it from the burdens common to individuals do not flow necessarily from the charter, but must be expressed in it, or they do not exist.\"\nIn that case, the bank was adjudged to be liable to a tax on its property as an individual.  Lord Coke says\n\n\"Every corporation \n  \n and body politic residing in any county, riding, city or town corporate, or having lands or tenements in any shire,  qua propriis manibus et sumptibus possident et habent,  are said to be inhabitants there within the purview of the statute.\"\nIn the case of  King v. Gardiner,  in Cowper, a corporation was decided by the Court of King's Bench to come within the description of occupiers or inhabitants.  In  Bank v. Deveaux,  the case relied upon most for the doctrines contended for by the plaintiff in error, it is said of a corporation, \"This ideal existence is considered as an inhabitant, when the general spirit and purposes of the law requires it.\"  If it be so for the purposes of taxation, why is it not so for the purposes of a suit in the circuit court of the United States, when the plaintiff has the proper residence?  Certainly the spirit and purposes of the law require it.  We confess our inability to reconcile these qualities of a corporation -- residence, habitancy, and individuality -- with the doctrine that a corporation aggregate cannot be a citizen for the purposes of a suit in the courts of the United States unless in consequence of a residence of all the corporators being of the state in which the suit is brought.  When the corporation exercises its powers in the state which chartered it, that is its residence, and such an averment is sufficient to give the circuit courts jurisdiction.\nOur conclusion makes it unnecessary for us to consider that averment in the plea which denies jurisdiction on the ground that citizens of the same state with the plaintiff are members of corporations in South Carolina, which are members of the Louisville, Cincinnati & Charleston Railroad Company.\n The judgment of the circuit court below is affirmed. Order \nThis cause came on to be heard on the transcript of the record from the Circuit Court of the United States for the District of South Carolina and was argued by counsel.  On consideration whereof it is now here ordered and adjudged by this Court that the judgment of the said circuit court in this cause be, and the same is hereby affirmed with costs and damages at the rate of six percentum per annum.\n"
  },
  "edge": {
    "shepards": "overrul",
    "agree": false
  },
  "overrule": {
    "overruling_case_name": "Louisville, Cincinnati & Charleston Railway Co. v. Letson,43 U.S. (2 How.) 497 (1844)",
    "year_overruled": 1844
  }
}